In [3]:
from datascience import *
import numpy as np

%matplotlib inline
import matplotlib.pyplot as plots
plots.style.use('fivethirtyeight')

# Lecture 11 #

## Lists

In [4]:
simple_list = ['hello', 7, 3.14, True] #multiple data types within a list
simple_list

['hello', 7, 3.14, True]

In [7]:
my_array = make_array('hello', 7, 3.14, True)
type(my_array.item(1)) # arrays want all elements to be of the same data type
# all integers, all floats, all strings, etc.
#all my elements were converted to strings (one data type)

str

In [18]:
my_array = make_array(1, 2, 3)

crowded_list = [my_array, 'what is going on', -10]
crowded_list[0]

array([1, 2, 3])

In [12]:
help(list)

Help on class list in module builtins:

class list(object)
 |  list(iterable=(), /)
 |
 |  Built-in mutable sequence.
 |
 |  If no argument is given, the constructor creates a new empty list.
 |  The argument must be an iterable if specified.
 |
 |  Methods defined here:
 |
 |  __add__(self, value, /)
 |      Return self+value.
 |
 |  __contains__(self, key, /)
 |      Return key in self.
 |
 |  __delitem__(self, key, /)
 |      Delete self[key].
 |
 |  __eq__(self, value, /)
 |      Return self==value.
 |
 |  __ge__(self, value, /)
 |      Return self>=value.
 |
 |  __getattribute__(self, name, /)
 |      Return getattr(self, name).
 |
 |  __getitem__(...)
 |      x.__getitem__(y) <==> x[y]
 |
 |  __gt__(self, value, /)
 |      Return self>value.
 |
 |  __iadd__(self, value, /)
 |      Implement self+=value.
 |
 |  __imul__(self, value, /)
 |      Implement self*=value.
 |
 |  __init__(self, /, *args, **kwargs)
 |      Initialize self.  See help(type(self)) for accurate signature.
 |
 |  __iter__(self, /)
 |      Implement iter(self).
 |
 |  __le__(self, value, /)
 |      Return self<=value.
 |
 |  __len__(self, /)
 |      Return len(self).
 |
 |  __lt__(self, value, /)
 |      Return self<value.
 |
 |  __mul__(self, value, /)
 |      Return self*value.
 |
 |  __ne__(self, value, /)
 |      Return self!=value.
 |
 |  __repr__(self, /)
 |      Return repr(self).
 |
 |  __reversed__(self, /)
 |      Return a reverse iterator over the list.
 |
 |  __rmul__(self, value, /)
 |      Return value*self.
 |
 |  __setitem__(self, key, value, /)
 |      Set self[key] to value.
 |
 |  __sizeof__(self, /)
 |      Return the size of the list in memory, in bytes.
 |
 |  append(self, object, /)
 |      Append object to the end of the list.
 |
 |  clear(self, /)
 |      Remove all items from list.
 |
 |  copy(self, /)
 |      Return a shallow copy of the list.
 |
 |  count(self, value, /)
 |      Return number of occurrences of value.
 |
 |  extend(self, iterable, /)
 |      Extend list by appending elements from the iterable.
 |
 |  index(self, value, start=0, stop=9223372036854775807, /)
 |      Return first index of value.
 |
 |      Raises ValueError if the value is not present.
 |
 |  insert(self, index, object, /)
 |      Insert object before index.
 |
 |  pop(self, index=-1, /)
 |      Remove and return item at index (default last).
 |
 |      Raises IndexError if list is empty or index is out of range.
 |
 |  remove(self, value, /)
 |      Remove first occurrence of value.
 |
 |      Raises ValueError if the value is not present.
 |
 |  reverse(self, /)
 |      Reverse *IN PLACE*.
 |
 |  sort(self, /, *, key=None, reverse=False)
 |      Stable sort *IN PLACE*.
 |
 |  ----------------------------------------------------------------------
 |  Static methods defined here:
 |
 |  __new__(*args, **kwargs) from builtins.type
 |      Create and return a new object.  See help(type) for accurate signature.
 |
 |  ----------------------------------------------------------------------
 |  Data and other attributes defined here:
 |
 |  __hash__ = None

In [26]:
my_table = Table().with_columns('Numbers', [1, 'dog', 3])
#Table() initializes an  empty table
# .with_column adds a new column, called 'Numbers'
# and we're populating this new column Numbers, with our a list [1,2,3]
my_table

Numbers
1
dog
3

In [34]:
# what would be the data type of dog, after we use a .column to extract the Numbers column
type(my_table.take(1))

# if we want to inspect a particular element's data type, we want to extract as an array first
# think arrays -- think I am more able to manipulate elements when they are stored in an array
# versus a table column/format

# what is the data type below?
# Table

datascience.tables.Table

In [35]:
my_table.index_by('Numbers')
# returns a dict or dictionary
#out of scope for CMPSC 5a class

my_table.column('Numbers') # returns an array

{'1': [Row(Numbers='1')], 'dog': [Row(Numbers='dog')], '3': [Row(Numbers='3')]}

In [36]:
drinks = Table(['Drink', 'Cafe', 'Price']) # column headings, using a list
drinks

Drink | Cafe | Price

In [37]:
drinks = drinks.with_rows([
    ['Milk Tea', 'Asha', 5.50],
    ['Espresso', 'Strada',  1.75],
    ['Latte',    'Strada',  3.25],
    ['Espresso', "FSM",   2]
])
drinks

Drink    | Cafe   | Price
Milk Tea | Asha   | 5.5
Espresso | Strada | 1.75
Latte    | Strada | 3.25
Espresso | FSM    | 2

## Challenge Question ##

In [50]:
sky = Table.read_table('data/skyscrapers_v2.csv')
sky = (sky.with_column('age', 2022 - sky.column('completed'))
          .drop('completed'))
sky.where('city', 'Austin').show()

In [75]:
abc_array = make_array('a','b','c')
Table().with_column('letters', abc_array).sort('letters', descending = True)

letters
c
b
a

In [70]:
# 1. For each city, what’s the tallest building for each material?
#sky.where('material','concrete').sort('height', descending = True).item(0)
#sky.select('material','height')#.group('material',max)
sky.group('material', max)
# the tallest building for concrete
# tallest building for mixed/composite
# tallest building for steel

# can you provide all three information above in one table?

material        | name max                 | city max          | height max | age max
concrete        | theWit Hotel             | Sunny Isles Beach | 425.5      | 109
mixed/composite | Westin Bonaventure Hotel | St. Louis         | 541.3      | 96
steel           | Wyndham New Yorker Hotel | St. Louis         | 442.14     | 136

In [46]:
sky.select('material', 'city', 'height').group(['city', 'material'], max)

city      | material        | height max
Atlanta   | concrete        | 264.25
Atlanta   | mixed/composite | 311.8
Atlanta   | steel           | 169.47
Austin    | concrete        | 208.15
Austin    | steel           | 93.6
Baltimore | concrete        | 161.24
Baltimore | steel           | 155.15
Boston    | concrete        | 121.92
Boston    | mixed/composite | 139
Boston    | steel           | 240.79
... (81 rows omitted)

In [79]:
sky_pivot = sky.pivot('material', 'city','height',max)
sky_pivot
# what other functions can i pass into pivot?
# min, sum, average, list
# age instead of height

city       | concrete | mixed/composite | steel
Atlanta    | 264.25   | 311.8           | 169.47
Austin     | 208.15   | 0               | 93.6
Baltimore  | 161.24   | 0               | 155.15
Boston     | 121.92   | 139             | 240.79
Charlotte  | 265.48   | 239.7           | 179.23
Chicago    | 423.22   | 306.94          | 442.14
Cincinnati | 125      | 202.69          | 175
Cleveland  | 125      | 288.65          | 215.8
Columbus   | 79.25    | 0               | 169.3
Dallas     | 176.48   | 280.72          | 270.06
... (25 rows omitted)

In [62]:
# 2. For each city, what’s the height difference between the tallest 
#    steel building and the tallest concrete building?

# For example, the tallest steel building in Atlanta is 169.47 ft 
# the tallest concrete building in Atlanta is #264.25 ft
# abs(169.47 - 264.25)





#sky.pivot('city','material') # default, is to give # of things in city, for material (count)
sky_pivot = sky.pivot('material', 'city','height',max)
sky_pivot
#sky.pivot('material','city','age',max) 
# oldest building for each material, in each city
# atlanta - oldest building for concrete, composite, steel



tallest_concrete_by_city = sky_pivot.column('concrete')
tallest_steel_by_city = sky_pivot.column('steel')
tallest_steel_by_city
height_differences = tallest_steel_by_city - tallest_concrete_by_city
sky_height_differences_concrete_steel = sky_pivot.with_column('height difference concrete steel', height_differences)
sky_height_differences_concrete_steel

city       | concrete | mixed/composite | steel  | height difference concrete steel
Atlanta    | 264.25   | 311.8           | 169.47 | -94.78
Austin     | 208.15   | 0               | 93.6   | -114.55
Baltimore  | 161.24   | 0               | 155.15 | -6.09001
Boston     | 121.92   | 139             | 240.79 | 118.87
Charlotte  | 265.48   | 239.7           | 179.23 | -86.25
Chicago    | 423.22   | 306.94          | 442.14 | 18.92
Cincinnati | 125      | 202.69          | 175    | 50
Cleveland  | 125      | 288.65          | 215.8  | 90.8
Columbus   | 79.25    | 0               | 169.3  | 90.05
Dallas     | 176.48   | 280.72          | 270.06 | 93.58
... (25 rows omitted)

Don't read ahead until you try the challenge questions yourself first!

### Take-home question: try it here!

In [ ]:
# Generate a table of the names of the oldest buildings for each 
# material for each city: (requires join)


# generate a table of the average ages of buildings, by material, for each city:

## Joins ##

In [63]:
drinks

Drink    | Cafe   | Price
Milk Tea | Asha   | 5.5
Espresso | Strada | 1.75
Latte    | Strada | 3.25
Espresso | FSM    | 2

In [64]:
discounts = Table().with_columns(
    'Coupon % off', make_array(10, 25, 5),
    'Location', make_array('Asha', 'Strada', 'Asha')
)
discounts

Coupon % off | Location
10           | Asha
25           | Strada
5            | Asha

In [65]:
combined = drinks.join('Cafe', discounts, 'Location')
combined

Cafe   | Drink    | Price | Coupon % off
Asha   | Milk Tea | 5.5   | 10
Asha   | Milk Tea | 5.5   | 5
Strada | Espresso | 1.75  | 25
Strada | Latte    | 3.25  | 25

In [67]:
discounted_frac = 1 - combined.column('Coupon % off') / 100
combined.with_column(
    'Discounted Price', 
    combined.column('Price') * discounted_frac
)
# how would you round the discounted price to two decimal places?

Cafe   | Drink    | Price | Coupon % off | Discounted Price
Asha   | Milk Tea | 5.5   | 10           | 4.95
Asha   | Milk Tea | 5.5   | 5            | 5.225
Strada | Espresso | 1.75  | 25           | 1.3125
Strada | Latte    | 3.25  | 25           | 2.4375

In [68]:
drinks.join('Cafe', drinks, 'Cafe')

Cafe   | Drink    | Price | Drink_2  | Price_2
Asha   | Milk Tea | 5.5   | Milk Tea | 5.5
FSM    | Espresso | 2     | Espresso | 2
Strada | Espresso | 1.75  | Espresso | 1.75
Strada | Espresso | 1.75  | Latte    | 3.25
Strada | Latte    | 3.25  | Espresso | 1.75
Strada | Latte    | 3.25  | Latte    | 3.25